In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates=pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  2.550038 -0.294916 -2.214536 -1.656187
2013-01-02  0.773730 -2.595861 -1.587875  1.646960
2013-01-03 -0.567308 -0.267226  0.066149 -0.876492
2013-01-04  0.011412 -1.926213  0.157931 -0.915023
2013-01-05 -1.784721 -1.196188  0.306475  0.552674
2013-01-06  1.020880 -0.878292 -1.732522 -0.380796

In [8]:
df2=pd.DataFrame({'A':1.,
                 'B':pd.Timestamp('20130102'),
                 'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                 'D':np.array([3]*4,dtype='int32'),
                 'E':pd.Categorical(['test','train','test','train']),
                 'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[ 2.55003767, -0.29491589, -2.21453602, -1.65618669],
       [ 0.77373033, -2.59586103, -1.58787488,  1.64696049],
       [-0.567308  , -0.26722605,  0.06614888, -0.87649196],
       [ 0.0114118 , -1.92621269,  0.15793097, -0.91502264],
       [-1.7847213 , -1.19618841,  0.30647537,  0.55267399],
       [ 1.02087952, -0.87829173, -1.73252227, -0.38079576]])

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.334005 -1.193116 -0.834063 -0.271477
std    1.481984  0.923935  1.129285  1.189049
min   -1.784721 -2.595861 -2.214536 -1.656187
25%   -0.422628 -1.743707 -1.696360 -0.905390
50%    0.392571 -1.037240 -0.760863 -0.628644
75%    0.959092 -0.440760  0.134985  0.319307
max    2.550038 -0.267226  0.306475  1.646960

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.550038    0.773730   -0.567308    0.011412   -1.784721    1.020880
B   -0.294916   -2.595861   -0.267226   -1.926213   -1.196188   -0.878292
C   -2.214536   -1.587875    0.066149    0.157931    0.306475   -1.732522
D   -1.656187    1.646960   -0.876492   -0.915023    0.552674   -0.380796

In [15]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -1.656187 -2.214536 -0.294916  2.550038
2013-01-02  1.646960 -1.587875 -2.595861  0.773730
2013-01-03 -0.876492  0.066149 -0.267226 -0.567308
2013-01-04 -0.915023  0.157931 -1.926213  0.011412
2013-01-05  0.552674  0.306475 -1.196188 -1.784721
2013-01-06 -0.380796 -1.732522 -0.878292  1.020880

In [16]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02  0.773730 -2.595861 -1.587875  1.646960
2013-01-04  0.011412 -1.926213  0.157931 -0.915023
2013-01-05 -1.784721 -1.196188  0.306475  0.552674
2013-01-06  1.020880 -0.878292 -1.732522 -0.380796
2013-01-01  2.550038 -0.294916 -2.214536 -1.656187
2013-01-03 -0.567308 -0.267226  0.066149 -0.876492

In [17]:
df['A']

2013-01-01    2.550038
2013-01-02    0.773730
2013-01-03   -0.567308
2013-01-04    0.011412
2013-01-05   -1.784721
2013-01-06    1.020880
Freq: D, Name: A, dtype: float64

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01  2.550038 -0.294916 -2.214536 -1.656187
2013-01-02  0.773730 -2.595861 -1.587875  1.646960
2013-01-03 -0.567308 -0.267226  0.066149 -0.876492

In [19]:
df.loc[:,['A','C']]

                   A         C
2013-01-01  2.550038 -2.214536
2013-01-02  0.773730 -1.587875
2013-01-03 -0.567308  0.066149
2013-01-04  0.011412  0.157931
2013-01-05 -1.784721  0.306475
2013-01-06  1.020880 -1.732522

In [20]:
df.loc['20130102':'20130105',['B','D']]

                   B         D
2013-01-02 -2.595861  1.646960
2013-01-03 -0.267226 -0.876492
2013-01-04 -1.926213 -0.915023
2013-01-05 -1.196188  0.552674

In [21]:
df.loc['20130103',['A','C']]

A   -0.567308
C    0.066149
Name: 2013-01-03 00:00:00, dtype: float64

In [22]:
df.iloc[3]

A    0.011412
B   -1.926213
C    0.157931
D   -0.915023
Name: 2013-01-04 00:00:00, dtype: float64

In [25]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.773730 -1.587875
2013-01-03 -0.567308  0.066149
2013-01-05 -1.784721  0.306475

In [26]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.773730 -2.595861 -1.587875  1.646960
2013-01-03 -0.567308 -0.267226  0.066149 -0.876492

In [27]:
df.iloc[1,1]

-2.595861032006398

In [28]:
df.iat[1,1]

-2.595861032006398

In [29]:
df[df.A>0]

                   A         B         C         D
2013-01-01  2.550038 -0.294916 -2.214536 -1.656187
2013-01-02  0.773730 -2.595861 -1.587875  1.646960
2013-01-04  0.011412 -1.926213  0.157931 -0.915023
2013-01-06  1.020880 -0.878292 -1.732522 -0.380796

In [30]:
df[df>0]

                   A   B         C         D
2013-01-01  2.550038 NaN       NaN       NaN
2013-01-02  0.773730 NaN       NaN  1.646960
2013-01-03       NaN NaN  0.066149       NaN
2013-01-04  0.011412 NaN  0.157931       NaN
2013-01-05       NaN NaN  0.306475  0.552674
2013-01-06  1.020880 NaN       NaN       NaN

In [31]:
df2=df.copy()

In [32]:
df2['E']=['one','one','two','three','four','three']

In [33]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.567308 -0.267226  0.066149 -0.876492   two
2013-01-05 -1.784721 -1.196188  0.306475  0.552674  four

In [34]:
s1=pd.Series([1,2,3,4,5,6])
s1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [35]:
df.iat[0,1]=0

In [36]:
df.loc[:,'D']=np.array([5]*len(df))

In [37]:
df2=df.copy()

In [40]:
df2[df2>0]=-df2
df2

                   A         B         C  D
2013-01-01 -2.550038  0.000000 -2.214536 -5
2013-01-02 -0.773730 -2.595861 -1.587875 -5
2013-01-03 -0.567308 -0.267226 -0.066149 -5
2013-01-04 -0.011412 -1.926213 -0.157931 -5
2013-01-05 -1.784721 -1.196188 -0.306475 -5
2013-01-06 -1.020880 -0.878292 -1.732522 -5

In [41]:
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])
df1

                   A         B         C  D   E
2013-01-01  2.550038  0.000000 -2.214536  5 NaN
2013-01-02  0.773730 -2.595861 -1.587875  5 NaN
2013-01-03 -0.567308 -0.267226  0.066149  5 NaN
2013-01-04  0.011412 -1.926213  0.157931  5 NaN

In [43]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  2.550038  0.000000 -2.214536  5  1.0
2013-01-02  0.773730 -2.595861 -1.587875  5  1.0
2013-01-03 -0.567308 -0.267226  0.066149  5  NaN
2013-01-04  0.011412 -1.926213  0.157931  5  NaN

In [44]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  2.550038  0.000000 -2.214536  5  1.0
2013-01-02  0.773730 -2.595861 -1.587875  5  1.0

In [45]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  2.550038  0.000000 -2.214536  5  1.0
2013-01-02  0.773730 -2.595861 -1.587875  5  1.0
2013-01-03 -0.567308 -0.267226  0.066149  5  5.0
2013-01-04  0.011412 -1.926213  0.157931  5  5.0

In [46]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [47]:
df.mean()

A    0.334005
B   -1.143963
C   -0.834063
D    5.000000
dtype: float64

In [49]:
s=pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [50]:
df.sub(s,axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.567308 -1.267226 -0.933851  4.0
2013-01-04 -2.988588 -4.926213 -2.842069  2.0
2013-01-05 -6.784721 -6.196188 -4.693525  0.0
2013-01-06       NaN       NaN       NaN  NaN

In [52]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  2.550038  0.000000 -2.214536   5
2013-01-02  3.323768 -2.595861 -3.802411  10
2013-01-03  2.756460 -2.863087 -3.736262  15
2013-01-04  2.767872 -4.789300 -3.578331  20
2013-01-05  0.983150 -5.985488 -3.271856  25
2013-01-06  2.004030 -6.863780 -5.004378  30

In [53]:
df.apply(lambda x:x.max()-x.min())

A    4.334759
B    2.595861
C    2.521011
D    0.000000
dtype: float64

In [54]:
s=pd.Series(np.random.randint(0,7,size=10))
s

0    1
1    1
2    2
3    2
4    0
5    5
6    5
7    2
8    1
9    2
dtype: int32

In [55]:
s.value_counts()

2    4
1    3
5    2
0    1
dtype: int64

In [56]:
s=pd.Series(['A','B','C','Aaba','Baca','CADB',np.nan,'dog','cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5    CADB
6     NaN
7     dog
8     cat
dtype: object

In [57]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5    CADB
6     NaN
7     DOG
8     CAT
dtype: object

In [58]:
df=pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.154555  1.365162 -0.090545  0.301009
1 -0.193939 -0.407888  0.813810 -0.256643
2 -1.600678  1.782788  0.233192 -1.086262
3  0.859616 -1.388578  0.314762 -0.355883
4  1.259691 -2.046510 -0.692470 -0.687914
5 -0.245375 -1.037887  0.637123 -0.739872
6 -1.275385 -0.676763 -0.882481  2.127954
7  2.701866 -1.540486 -1.268886 -1.536325
8 -2.399563 -0.592124  0.961869 -0.147517
9  1.630789 -0.275825  0.349788  0.206881

In [59]:
pieces=[df[:3],df[3:7],df[7:]]

In [60]:
pd.concat(pieces)

          0         1         2         3
0  0.154555  1.365162 -0.090545  0.301009
1 -0.193939 -0.407888  0.813810 -0.256643
2 -1.600678  1.782788  0.233192 -1.086262
3  0.859616 -1.388578  0.314762 -0.355883
4  1.259691 -2.046510 -0.692470 -0.687914
5 -0.245375 -1.037887  0.637123 -0.739872
6 -1.275385 -0.676763 -0.882481  2.127954
7  2.701866 -1.540486 -1.268886 -1.536325
8 -2.399563 -0.592124  0.961869 -0.147517
9  1.630789 -0.275825  0.349788  0.206881

In [61]:
left=pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})
right=pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})

In [63]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [64]:
left=pd.DataFrame({'key':['foo','bar'],'lval':[1,2]})
right=pd.DataFrame({'key':['foo','bar'],'rval':[4,5]})

In [66]:
pd.merge(left,right,on='key',how='left')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [67]:
df=pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])

In [68]:
s=df.iloc[3]

In [69]:
df.append(s,ignore_index=True)

          A         B         C         D
0  0.319515 -0.626073  0.580416  1.490369
1 -0.862424 -0.251013  0.529585 -1.140682
2 -0.918373  0.137588  1.887661  0.746150
3  2.881497  0.194677 -0.050964 -0.936705
4 -0.350403 -0.699314  0.308607  0.443075
5 -0.050331 -0.134603 -1.054446  1.214958
6 -0.346738  0.983219  1.489098 -0.718453
7  0.454836 -1.125950 -0.017959  0.041403
8  2.881497  0.194677 -0.050964 -0.936705

In [107]:
df=pd.DataFrame({'A':['foo','bar','foo','bar',
                     'foo','bar','foo','bar'],
                'B':['one','one','two','three',
                    'two','two','one','three'],
                'C':np.random.randn(8),
                'D':np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.923811  0.266734
1  bar    one -0.679243 -0.055417
2  foo    two  0.754863 -1.329350
3  bar  three  0.777488 -0.470150
4  foo    two -1.217992  1.565087
5  bar    two -1.868925 -0.840668
6  foo    one  0.685248 -0.334874
7  bar  three -0.833851 -0.647176

In [71]:
df.groupby('A').sum()

            C         D
A
bar -1.035273  1.011102
foo  3.697017 -2.416925

In [113]:
df=pd.DataFrame({'A':['dog','dog','cat','cat','dog','dog'],
                 'B':['like','dislike','like','dislike','like','like'],
                 'C':np.random.rand(6)})
df.groupby(['A','B']).mean()

                    C
A   B
cat dislike  0.695250
    like     0.472336
dog dislike  0.630063
    like     0.571315

In [72]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.172695 -0.068320
    three  0.872100  1.706844
    two   -2.080068 -0.627421
foo one    1.613994 -2.182288
    two    2.083024 -0.234637

In [108]:
df.groupby(['A','B']).mean()

                  C         D
A   B
bar one   -0.679243 -0.055417
    three -0.028181 -0.558663
    two   -1.868925 -0.840668
foo one    0.804530 -0.034070
    two   -0.231565  0.117869

In [88]:
tuples=list(zip(*[['bar','bar','baz','baz','foo','foo','qux','qux'],
                 ['one','two','one','two','one','two','one','two']]))

In [89]:
index=pd.MultiIndex.from_tuples(tuples,names=['first','second'])

In [90]:
df=pd.DataFrame(np.random.randn(8,2),index=index,columns=['A','B'])
df

                     A         B
first second
bar   one     0.743660 -0.267844
      two    -1.267346  2.832014
baz   one     1.714821  0.414025
      two    -0.207536 -0.019785
foo   one     0.427065  0.249949
      two    -1.323052 -0.534282
qux   one    -0.489655  0.071235
      two     1.317439  0.585378

In [91]:
df2=df[4:]

In [92]:
df2

                     A         B
first second
foo   one     0.427065  0.249949
      two    -1.323052 -0.534282
qux   one    -0.489655  0.071235
      two     1.317439  0.585378

In [93]:
stacked=df2.stack()
stacked

first  second
foo    one     A    0.427065
               B    0.249949
       two     A   -1.323052
               B   -0.534282
qux    one     A   -0.489655
               B    0.071235
       two     A    1.317439
               B    0.585378
dtype: float64

In [94]:
stacked.unstack()

                     A         B
first second
foo   one     0.427065  0.249949
      two    -1.323052 -0.534282
qux   one    -0.489655  0.071235
      two     1.317439  0.585378

In [96]:
stacked.unstack(1)

second        one       two
first
foo   A  0.427065 -1.323052
      B  0.249949 -0.534282
qux   A -0.489655  1.317439
      B  0.071235  0.585378

In [97]:
stacked.unstack(0)

first          foo       qux
second
one    A  0.427065 -0.489655
       B  0.249949  0.071235
two    A -1.323052  1.317439
       B -0.534282  0.585378

In [98]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                     'B' : ['A', 'B', 'C'] * 4,
                     'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                      'D' : np.random.randn(12),
                    'E' : np.random.randn(12)})

In [99]:
df

        A  B    C         D         E
0     one  A  foo -0.471694 -1.595132
1     one  B  foo  1.553495  0.579220
2     two  C  foo -0.450579  0.662626
3   three  A  bar  2.386944  0.297893
4     one  B  bar -0.711283  0.957967
5     one  C  bar  1.060436 -1.951843
6     two  A  foo  1.551896 -0.067106
7   three  B  foo  0.860149 -0.089063
8     one  C  foo  0.281573  1.100872
9     one  A  bar  1.716967 -0.142796
10    two  B  bar -0.903984  0.904679
11  three  C  bar -1.101183 -0.655232

In [100]:
pd.pivot_table(df,values='D',index=['A','B'],columns=['C'])

C             bar       foo
A     B
one   A  1.716967 -0.471694
      B -0.711283  1.553495
      C  1.060436  0.281573
three A  2.386944       NaN
      B       NaN  0.860149
      C -1.101183       NaN
two   A       NaN  1.551896
      B -0.903984       NaN
      C       NaN -0.450579

In [101]:
rng=pd.date_range('1/1/2012',periods=100,freq='S')

In [102]:
ts=pd.Series(np.random.randint(0,500,len(rng)),index=rng)

In [106]:
ts.resample('5Min').sum()#每5分钟取一次样

2012-01-01    26088
Freq: 5T, dtype: int32

In [105]:
#help(pd.date_range)

In [2]:
rng=pd.date_range('3/6/2012 00:00',periods=5,freq='D')

In [3]:
ts=pd.Series(np.random.randn(len(rng)),rng)

In [4]:
ts

2012-03-06   -0.152950
2012-03-07   -0.601129
2012-03-08    0.957282
2012-03-09    2.171592
2012-03-10    0.477509
Freq: D, dtype: float64

In [5]:
ts_utc=ts.tz_localize('UTC')

In [6]:
ts_utc

2012-03-06 00:00:00+00:00   -0.152950
2012-03-07 00:00:00+00:00   -0.601129
2012-03-08 00:00:00+00:00    0.957282
2012-03-09 00:00:00+00:00    2.171592
2012-03-10 00:00:00+00:00    0.477509
Freq: D, dtype: float64

In [7]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.152950
2012-03-06 19:00:00-05:00   -0.601129
2012-03-07 19:00:00-05:00    0.957282
2012-03-08 19:00:00-05:00    2.171592
2012-03-09 19:00:00-05:00    0.477509
Freq: D, dtype: float64

In [8]:
rng=pd.date_range('1/1/2012',periods=5,freq='M')

In [9]:
ts=pd.Series(np.random.randn(len(rng)),index=rng)

In [10]:
ts

2012-01-31    0.703889
2012-02-29   -0.808650
2012-03-31    0.069015
2012-04-30    0.266854
2012-05-31    1.176496
Freq: M, dtype: float64

In [11]:
ps=ts.to_period()
ps

2012-01    0.703889
2012-02   -0.808650
2012-03    0.069015
2012-04    0.266854
2012-05    1.176496
Freq: M, dtype: float64

In [13]:
ps.to_timestamp()

2012-01-01    0.703889
2012-02-01   -0.808650
2012-03-01    0.069015
2012-04-01    0.266854
2012-05-01    1.176496
Freq: MS, dtype: float64

In [14]:
prng=pd.period_range('1990Q1','2000Q4',freq='Q-NOV')

In [15]:
ts=pd.Series(np.random.randn(len(prng)),prng)

In [17]:
ts.index=(prng.asfreq('M','e')+1).asfreq('H','s')+9
ts.head()

1990-03-01 09:00   -0.387538
1990-06-01 09:00    0.335075
1990-09-01 09:00   -0.474383
1990-12-01 09:00    0.288616
1991-03-01 09:00    0.692630
Freq: H, dtype: float64

In [18]:
prng=pd.period_range('1991Q1','2000Q4',freq='Q-NOV')

In [19]:
ts=pd.Series(np.random.randn(len(prng)),prng)

In [21]:
ts.index=(prng.asfreq('M','e')+1).asfreq('H','s')+9

In [22]:
prng=pd.period_range('1991Q1','2000Q4',freq='Q-NOV')
ts=pd.Series(np.random.randn(len(prng)),prng)
ts.index=(prng.asfreq('M','e')+1).asfreq('H','s')
ts.head()

1991-03-01 00:00   -0.866079
1991-06-01 00:00   -0.539261
1991-09-01 00:00    0.963484
1991-12-01 00:00    1.163044
1992-03-01 00:00   -0.882235
Freq: H, dtype: float64

In [34]:
 df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [35]:
df['grade']=df['raw_grade'].astype('category')

In [36]:
df['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [37]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [39]:
df

   id raw_grade grade
0   1         a   NaN
1   2         b   NaN
2   3         b   NaN
3   4         a   NaN
4   5         a   NaN
5   6         e   NaN

In [41]:
df.sort_values(by='grade')

   id raw_grade grade
0   1         a   NaN
1   2         b   NaN
2   3         b   NaN
3   4         a   NaN
4   5         a   NaN
5   6         e   NaN

In [42]:
df.groupby('grade').size()

grade
very bad     0
bad          0
medium       0
good         0
very good    0
dtype: int64